projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/РасстоянияМеждуТаможеннымиПунктами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РасстоянияМеждуТаможеннымиПунктами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответсвенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПунктНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ТарифныеСеткиОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСеткиОбеспечения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикиСуммЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпецЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ЦенообразованиеКодовCMR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦенообразованиеКодовCMR</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаПервуюCMR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаДополнительнуюCMR</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЗаДополнительныйКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоБесплатныхКодов</Name>
					<Comment>Количество бесплатных кодов для каждой CMR</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУслугОрганизации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ТипыУчетаКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУчетаКлиентов</Name>
			<Comment>Определяет какие услуги рассчитывать для клиента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Комплекс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоОбеспечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоТД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ТипыУслугОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыУслугОрганизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодыCMR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформлениеТД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ТипыДополнительныхАналитикЦенообразования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДополнительныхАналитикЦенообразования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистративныйОкруг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Страна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоТаможенныхПунктов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/Enums/ВидыРасчетаЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыРасчетаЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/CommonModules/исРасчет/Ext/Module.bsl
// =============================================================================
// Общий модуль: исРасчет
// Расчёт стоимости услуг по операциям поручительства.
//
// Точка входа:       ОбновитьЦеныНаСервере(Объект)
// Логика роутинга:   ТипУчета per-row (ТЧ ДанныеДокументов) - агрегат с фильтрацией (B1)
// Легковые авто:     каждая CMR рассчитывается отдельно через тарифную сетку
// =============================================================================

#Область ПрограммныйИнтерфейс

// Главная точка входа: пересчитать все цены документа.
// Вызывается из формы документа (кнопка "Рассчитать") и из ObjectModule (ПередЗаписью).
//
// Доработка START {Задача 13: ТипУчета per-row - агрегат с фильтрацией (B1)} {2026-04-13}
// ТипУчета берётся из каждой строки ТЧ ДанныеДокументов (не из контрагента).
// Обеспечение = SUM строк где ТипУчета из {Комплекс, ТолькоОбеспечение, <пусто>}.
// CMR = все книжки, если хотя бы одна строка имеет обеспечение.
// ТД = считать, если хотя бы одна строка из {Комплекс, ТолькоТД, <пусто>}.
// Доработка END
//
&НаСервере
Процедура ОбновитьЦеныНаСервере(Объект) Экспорт
	Объект.ОплатыУслуг.Очистить();
	Объект.ДополнительныеУслуги.Очистить();

	// Доработка START {Задача 15: Автодетект по данным + ТипУчета как ограничитель} {2026-04-13}
	// Данные определяют что МОЖНО считать, ТипУчета определяет что НУЖНО.
	// Если ДДП есть с суммой > 0 → обеспечение возможно.
	// Если CMR есть → CMR/коды/ТД возможны.
	// ТипУчета ограничивает сверху: ТолькоОбеспечение отключает CMR/ТД, ТолькоТД отключает обеспечение.
	ЕстьОбеспечение = Ложь;
	ЕстьCMR = Ложь;
	ЕстьТД = Ложь;

	// 1. Анализ ТЧ ДанныеДокументов (ДДП) — что разрешает ТипУчета + есть ли данные обеспечения
	// Доработка START {Фикс: пустой per-row ТипУчета → fallback на контрагента, НЕ на Комплекс} {2026-04-14}
	// EPF APIСигма не заполняет ТипУчета в ТЧ ДанныеДокументов.
	// Без fallback пустой ТипУчета = Комплекс → CMR/ТД считаются для ТолькоОбеспечение клиентов.
	ТипУчетаКонтрагента = ПолучитьТипУчетаКонтрагента(Объект.Контрагент);
	// Доработка END
	ЕстьДанныеОбеспечения = Ложь;
	Для Каждого СтрокаДД Из Объект.ДанныеДокументов Цикл
		ТипСтроки = СтрокаДД.ТипУчета;
		// Доработка START {Фикс: пустой per-row → fallback на контрагента} {2026-04-14}
		Если НЕ ЗначениеЗаполнено(ТипСтроки) Тогда
			ТипСтроки = ТипУчетаКонтрагента;
		КонецЕсли;
		// Доработка END
		Если НЕ ЗначениеЗаполнено(ТипСтроки)
			ИЛИ ТипСтроки = Перечисления.ТипыУчетаКлиентов.Комплекс Тогда
			Если СтрокаДД.СуммаОбеспечения > 0 Тогда
				ЕстьДанныеОбеспечения = Истина;
			КонецЕсли;
			ЕстьОбеспечение = Истина;
			ЕстьCMR = Истина;
			ЕстьТД = Истина;
		ИначеЕсли ТипСтроки = Перечисления.ТипыУчетаКлиентов.ТолькоОбеспечение Тогда
			Если СтрокаДД.СуммаОбеспечения > 0 Тогда
				ЕстьДанныеОбеспечения = Истина;
			КонецЕсли;
			ЕстьОбеспечение = Истина;
		ИначеЕсли ТипСтроки = Перечисления.ТипыУчетаКлиентов.ТолькоТД Тогда
			ЕстьCMR = Истина;
			ЕстьТД = Истина;
		КонецЕсли;
	КонецЦикла;

	// Обеспечение возможно только если реально есть суммы > 0
	ЕстьОбеспечение = ЕстьОбеспечение И ЕстьДанныеОбеспечения;

	// 2. Автодетект по CMR: если ДДП нет, но CMR есть → считать CMR/коды/ТД
	// Доработка START {Фикс: автодетект не должен включать CMR для ТолькоОбеспечение} {2026-04-14}
	Если НЕ ЕстьCMR И Объект.КодыCMR.Количество() > 0
		И ТипУчетаКонтрагента <> Перечисления.ТипыУчетаКлиентов.ТолькоОбеспечение Тогда
		ЕстьCMR = Истина;
		ЕстьТД = Истина;
	КонецЕсли;
	// Доработка END

	// 3. Fallback: если обе ТЧ пусты — определяем по контрагенту (старое поведение)
	Если Объект.ДанныеДокументов.Количество() = 0 И Объект.КодыCMR.Количество() = 0 Тогда
		ТипУчета = ПолучитьТипУчетаКонтрагента(Объект.Контрагент);
		ЕстьОбеспечение = ТипУчета <> Перечисления.ТипыУчетаКлиентов.ТолькоТД;
		ЕстьCMR = ТипУчета <> Перечисления.ТипыУчетаКлиентов.ТолькоОбеспечение;
		ЕстьТД = ТипУчета <> Перечисления.ТипыУчетаКлиентов.ТолькоОбеспечение;
	КонецЕсли;
	// Доработка END

	// Обеспечение (тарифная сетка)
	Если ЕстьОбеспечение Тогда
		РассчитатьОбеспечение(Объект);
	КонецЕсли;

	// CMR книжки + коды ТНВЭД (с per-row фильтрацией по ТипУчета)
	Если ЕстьCMR Тогда
		РассчитатьСуммуCMR(Объект);
	КонецЕсли;

	// Оформление ТД
	Если ЕстьТД Тогда
		РассчитатьОформлениеТД(Объект);
	КонецЕсли;

	// Доработка START {CRITICAL: Оплата должна вычисляться серверно, не только на клиенте} {2026-04-09}
	// Без этой строки Оплата = 0 при загрузке из API и при ПередЗаписью
	Объект.Оплата = Объект.ОплатыУслуг.Итог("Сумма")
		+ Объект.ОплатыУслуг.Итог("СуммаКодов")
		+ Объект.ДополнительныеУслуги.Итог("Сумма");
	// Доработка END

	// Доработка START {Задача 15: автозаполнение обязательных реквизитов шапки при расчёте} {2026-04-13}
	// ПередЗаписью проверяет КоличествоCMR, УслугаОрганизации, ВалютаОплаты — заполняем если пусты.
	Если Объект.КоличествоCMR = 0 Тогда
		Объект.КоличествоCMR = Объект.КодыCMR.Количество();
	КонецЕсли;
	// УслугаОрганизации: справочник пуст, автозаполнение невозможно. Проверка убрана из ПередЗаписью.
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаОплаты) Тогда
		Объект.ВалютаОплаты = исОбщийМодульСервер.ВалютаРегламентированногоУчета();
	КонецЕсли;
	// Доработка END

	РассчитатьАгентскиеВознаграждения(Объект);
КонецПроцедуры

// Получить расстояние между таможенными пунктами из регистра сведений.
// Проверяет оба направления (А→Б и Б→А), возвращает первое ненулевое.
//
&НаСервере
Функция РассчитатьРасстояниеМеждуПунктами(ПунктНазначения, ПунктОтправления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасстояниеМеждуТаможеннымиПунктами.Расстояние,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВремВТ
	|ИЗ
	|	РегистрСведений.РасстоянияМеждуТаможеннымиПунктами КАК РасстояниеМеждуТаможеннымиПунктами
	|ГДЕ
	|	РасстояниеМеждуТаможеннымиПунктами.ПунктОтправления = &ПунктОтправления
	|	И РасстояниеМеждуТаможеннымиПунктами.ПунктНазначения = &ПунктНазначения
	|	И РасстояниеМеждуТаможеннымиПунктами.Расстояние <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасстояниеМеждуТаможеннымиПунктами.Расстояние,
	|	2
	|ИЗ
	|	РегистрСведений.РасстоянияМеждуТаможеннымиПунктами КАК РасстояниеМеждуТаможеннымиПунктами
	|ГДЕ
	|	РасстояниеМеждуТаможеннымиПунктами.ПунктОтправления = &ПунктНазначения
	|	И РасстояниеМеждуТаможеннымиПунктами.ПунктНазначения = &ПунктОтправления
	|	И РасстояниеМеждуТаможеннымиПунктами.Расстояние <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВремВТ.Расстояние
	|ИЗ
	|	ВремВТ КАК ВремВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремВТ.Приоритет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремВТ";

	Запрос.УстановитьПараметр("ПунктНазначения", ПунктНазначения);
	Запрос.УстановитьПараметр("ПунктОтправления", ПунктОтправления);

	МасРезультат = Запрос.ВыполнитьПакет();
	Результат = МасРезультат[1];
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Расстояние;
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ---------------------------------------------------------------------------
// Обеспечение
// ---------------------------------------------------------------------------

// Обёртка: рассчитать стоимость обеспечения с учётом типа транспорта.
// Легковые авто: каждая CMR рассчитывается отдельно (индивидуальная стоимость).
// Остальные: агрегатная сумма по строкам с обеспечением.
//
&НаСервере
Процедура РассчитатьОбеспечение(Объект)
	Расстояние = РассчитатьРасстояниеМеждуПунктами(Объект.ПунктНазначения, Объект.ПунктОтправления);
	Если Расстояние = Неопределено ИЛИ Расстояние = 0 Тогда
		Расстояние = Объект.РасстояниеИтог;
	КонецЕсли;
	// Fallback: если расстояние из регистра и итога = 0, берём из шапки
	Если Расстояние = 0 Тогда
		Расстояние = Объект.Расстояние;
	КонецЕсли;

	// Доработка START {Задача 13: сумма обеспечения только из строк с обеспечением} {2026-04-13}
	// Фильтруем строки ДанныеДокументов по ТипУчета: Комплекс, ТолькоОбеспечение, <пусто>.
	// Строки с ТолькоТД исключаются из суммы обеспечения.
	СуммаОбеспеченияДляРасчета = 0;
	Для Каждого СтрокаДД Из Объект.ДанныеДокументов Цикл
		ТипСтроки = СтрокаДД.ТипУчета;
		Если ТипСтроки = Перечисления.ТипыУчетаКлиентов.ТолькоТД Тогда
			Продолжить;
		КонецЕсли;
		СуммаОбеспеченияДляРасчета = СуммаОбеспеченияДляРасчета + СтрокаДД.СуммаОбеспечения;
	КонецЦикла;
	// Fallback: если ТЧ пуста или сумма = 0 - берём из шапки (старое поведение)
	Если СуммаОбеспеченияДляРасчета = 0 И Объект.СуммаОбеспечения > 0 Тогда
		СуммаОбеспеченияДляРасчета = Объект.СуммаОбеспечения;
	КонецЕсли;
	// Доработка END

	Если ЭтоЛегковыеАвто(Объект.КодВидаТС) Тогда
		// Доработка START {CRITICAL #9: Предзагрузка тарифной сетки — 5 SQL один раз вместо 5×N} {2026-04-09}
		// Легковые: каждая CMR-книжка = отдельный автомобиль с индивидуальной суммой обеспечения.
		// КешСетки заполняется при первом вызове и переиспользуется для остальных CMR.
		КешСетки = Новый Структура;
		ИтогоОбеспечение = 0;
		Для Каждого СтрокаCMR Из Объект.КодыCMR Цикл
			Если СтрокаCMR.Цена > 0 Тогда
				ИтогоОбеспечение = ИтогоОбеспечение
					+ РассчитатьЦенуПоСетке(Объект, СтрокаCMR.Цена, Расстояние, КешСетки);
			КонецЕсли;
		КонецЦикла;
		// Доработка END
	Иначе
		// Грузовые и прочие: агрегатная сумма.
		ИтогоОбеспечение = РассчитатьЦенуПоСетке(Объект, СуммаОбеспеченияДляРасчета, Расстояние);
	КонецЕсли;

	Если ИтогоОбеспечение = 0 И СуммаОбеспеченияДляРасчета > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Основная услуга не рассчитана. Возможные причины: нет тарифной сетки для контрагента, "
			+ "расстояние не заполнено, или сумма обеспечения выходит за рамки сетки. "
			+ "Обеспечение: " + Формат(СуммаОбеспеченияДляРасчета, "ЧДЦ=2") + ", расстояние: " + Расстояние + " км.");
	КонецЕсли;

	СтрокаУслуги = Объект.ОплатыУслуг.Добавить();
	СтрокаУслуги.Услуга = Перечисления.ТипыУслугОрганизации.ОсновнаяУслуга;
	СтрокаУслуги.Сумма = ИтогоОбеспечение;

	// Доработка START {GAP-D1: Весовая разбивка стоимости обеспечения по строкам ТЧ} {2026-04-13}
	// Формула из Excel Владимира (подтверждена на 100% — 21 мультигруппа из "Рене 1-7.xlsx"):
	//   ЦенаОбеспечения(i) = ИтогоОбеспечение * (СуммаОбеспечения(i) / SUM(СуммаОбеспечения))
	// Для одиночных строк: ЦенаОбеспечения = ИтогоОбеспечение (1:1).
	РаспределитьЦенуОбеспеченияПоСтрокам(Объект, ИтогоОбеспечение, СуммаОбеспеченияДляРасчета);
	// Доработка END
КонецПроцедуры

// Весовая разбивка стоимости обеспечения по строкам ТЧ ДанныеДокументов.
// ЦенаОбеспечения(i) = ОбщаяСтоимость * (СуммаОбеспечения(i) / SUM(СуммаОбеспечения))
// Строки с ТолькоТД получают 0.
// Остаток от округления добавляется к первой строке (балансировка копейки).
//
&НаСервере
Процедура РаспределитьЦенуОбеспеченияПоСтрокам(Объект, ИтогоОбеспечение, ОбщаяСуммаОбеспечения)
	Если ОбщаяСуммаОбеспечения = 0 ИЛИ ИтогоОбеспечение = 0 Тогда
		Для Каждого СтрокаДД Из Объект.ДанныеДокументов Цикл
			СтрокаДД.ЦенаОбеспечения = 0;
		КонецЦикла;
		Возврат;
	КонецЕсли;

	СуммаРаспределено = 0;
	ПерваяСтрокаОбеспечения = Неопределено;

	Для Каждого СтрокаДД Из Объект.ДанныеДокументов Цикл
		ТипСтроки = СтрокаДД.ТипУчета;
		Если ТипСтроки = Перечисления.ТипыУчетаКлиентов.ТолькоТД Тогда
			СтрокаДД.ЦенаОбеспечения = 0;
			Продолжить;
		КонецЕсли;

		Если СтрокаДД.СуммаОбеспечения = 0 Тогда
			СтрокаДД.ЦенаОбеспечения = 0;
			Продолжить;
		КонецЕсли;

		ЦенаСтроки = Окр(ИтогоОбеспечение * СтрокаДД.СуммаОбеспечения / ОбщаяСуммаОбеспечения, 2);
		СтрокаДД.ЦенаОбеспечения = ЦенаСтроки;
		СуммаРаспределено = СуммаРаспределено + ЦенаСтроки;

		Если ПерваяСтрокаОбеспечения = Неопределено Тогда
			ПерваяСтрокаОбеспечения = СтрокаДД;
		КонецЕсли;
	КонецЦикла;

	// Балансировка остатка от округления (±копейка) на первую строку.
	Остаток = ИтогоОбеспечение - СуммаРаспределено;
	Если Остаток <> 0 И ПерваяСтрокаОбеспечения <> Неопределено Тогда
		ПерваяСтрокаОбеспечения.ЦенаОбеспечения = ПерваяСтрокаОбеспечения.ЦенаОбеспечения + Остаток;
	КонецЕсли;
КонецПроцедуры

// Ядро тарификации: найти цену по тарифной сетке обеспечения.
// Извлечено из бывшей РассчитатьОсновнуюУслугу.
// Параметры СуммаОбеспечения и Расстояние позволяют вызывать функцию
// как для агрегата (ОбеспечениеИтог), так и для одной CMR (легковые).
//
// Возвращает: Число — рассчитанная цена в рублях (или 0 если тариф не найден / индивидуальный).
//
&НаСервере
Функция РассчитатьЦенуПоСетке(Объект, СуммаОбеспечения, Расстояние, КешСетки = Неопределено)

	Если СуммаОбеспечения = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Обеспечение: сумма обеспечения = 0. Расчёт по тарифной сетке невозможен.");
		Возврат 0;
	КонецЕсли;

	// Доработка START {CRITICAL #9: Кеширование тарифной сетки для легковых (5 SQL один раз)} {2026-04-09}
	// Если кеш заполнен предыдущим вызовом — пропускаем SQL-запросы
	Если КешСетки <> Неопределено И КешСетки.Свойство("Загружено") Тогда
		Если КешСетки.Пусто Тогда
			Возврат 0;
		КонецЕсли;
		Возврат НайтиЦенуВКешеСетки(КешСетки, СуммаОбеспечения, Расстояние, Объект);
	КонецЕсли;
	// Доработка END

	// Доработка START {СпецЦены: справочник СеткиСпецЦен — одно поле вместо трёх} {2026-04-12}
	// Пользователь выбирает элемент справочника СеткиСпецЦен в документе.
	// Три субконто читаются из реквизитов справочника → фильтруют регистр ТарифныеСеткиОбеспечения.
	// 1. Пакет из 5 запросов к тарифной сетке
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЦеныПоГруппам.КлючАналитик КАК КлючАналитик,
	|	ЦеныПоГруппам.КлючАналитик.ИспользоватьДополнительнуюАналитику КАК ИспользоватьДополнительнуюАналитику,
	|	ЦеныПоГруппам.КлючАналитик.ТипДополнительнойАналитики КАК ТипДополнительнойАналитики,
	|	ЦеныПоГруппам.СпецЦены КАК СпецЦены,
	|	ЦеныПоГруппам.СубконтоСпецЦены КАК СубконтоСпецЦены,
	|	ЦеныПоГруппам.СубконтоСпецЦены2 КАК СубконтоСпецЦены2,
	|	ЦеныПоГруппам.СубконтоСпецЦены3 КАК СубконтоСпецЦены3
	|ПОМЕСТИТЬ КлючВТ
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		ЦенообразованиеСеткаСрезПоследних.КлючАналитик КАК КлючАналитик,
	|		ЦенообразованиеСеткаСрезПоследних.КлючАналитик.ИспользоватьДополнительнуюАналитику КАК ИспользоватьДополнительнуюАналитику,
	|		ЦенообразованиеСеткаСрезПоследних.КлючАналитик.ТипДополнительнойАналитики КАК ТипДополнительнойАналитики,
	|		ЦенообразованиеСеткаСрезПоследних.СпецЦены КАК СпецЦены,
	|		ЦенообразованиеСеткаСрезПоследних.Период КАК Период,
	|		ЦенообразованиеСеткаСрезПоследних.СубконтоСпецЦены КАК СубконтоСпецЦены,
	|		ЦенообразованиеСеткаСрезПоследних.СубконтоСпецЦены2 КАК СубконтоСпецЦены2,
	|		ЦенообразованиеСеткаСрезПоследних.СубконтоСпецЦены3 КАК СубконтоСпецЦены3
	|	ИЗ
	|		РегистрСведений.ТарифныеСеткиОбеспечения.СрезПоследних(
	|				&Дата,
	|				Контрагент = &Контрагент
	|					И СпецЦены = &СпецЦены
	|					И (НЕ &СпецЦены
	|						ИЛИ (СубконтоСпецЦены = &СубконтоСпецЦены
	|							И СубконтоСпецЦены2 = &СубконтоСпецЦены2
	|							И СубконтоСпецЦены3 = &СубконтоСпецЦены3))) КАК ЦенообразованиеСеткаСрезПоследних
	|
	|	УПОРЯДОЧИТЬ ПО
	|		Период УБЫВ) КАК ЦеныПоГруппам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючАналитикСрезПоследних.АналитикаСумм КАК АналитикаСумм,
	|	КлючАналитикСрезПоследних.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	|	КлючАналитикСрезПоследних.Цена КАК Цена,
	|	КлючАналитикСрезПоследних.ВидРасчета КАК ВидРасчета,
	|	КлючАналитикСрезПоследних.ИндивидуальныйРасчет КАК ИндивидуальныйРасчет,
	|	КлючАналитикСрезПоследних.Валюта КАК Валюта,
	|	КлючАналитикСрезПоследних.МинимальнаяЦена КАК МинимальнаяЦена
	|ПОМЕСТИТЬ ВремВТ
	|ИЗ
	|	РегистрСведений.ТарифныеСеткиОбеспечения.СрезПоследних(
	|			&Дата,
	|			Контрагент = &Контрагент
	|				И (КлючАналитик, СпецЦены, СубконтоСпецЦены, СубконтоСпецЦены2, СубконтоСпецЦены3) В
	|					(ВЫБРАТЬ
	|						КлючВТ.КлючАналитик,
	|						КлючВТ.СпецЦены,
	|						КлючВТ.СубконтоСпецЦены,
	|						КлючВТ.СубконтоСпецЦены2,
	|						КлючВТ.СубконтоСпецЦены3
	|					ИЗ
	|						КлючВТ КАК КлючВТ)) КАК КлючАналитикСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлючВТ.КлючАналитик КАК КлючАналитик,
	|	КлючВТ.ИспользоватьДополнительнуюАналитику КАК ИспользоватьДополнительнуюАналитику,
	|	КлючВТ.ТипДополнительнойАналитики КАК ТипДополнительнойАналитики
	|ИЗ
	|	КлючВТ КАК КлючВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремВТ.АналитикаСумм КАК АналитикаСумм,
	|	ВремВТ.АналитикаСумм.ЗначениеАналитики КАК ЗначениеАналитики
	|ИЗ
	|	ВремВТ КАК ВремВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначениеАналитики УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ЗначениеАналитики)
	|ПО
	|	ОБЩИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВремВТ.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	|	ВремВТ.ДополнительнаяАналитика.ЗначениеАналитики КАК ЗначениеАналитики
	|ИЗ
	|	ВремВТ КАК ВремВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначениеАналитики УБЫВ,
	|	ВремВТ.ДополнительнаяАналитика.ПорядокСортировкиВКлючеАналитик УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремВТ.АналитикаСумм КАК АналитикаСумм,
	|	ВремВТ.ДополнительнаяАналитика КАК ДополнительнаяАналитика,
	|	ВремВТ.Цена КАК Цена,
	|	ВремВТ.ВидРасчета КАК ВидРасчета,
	|	ВремВТ.Валюта КАК Валюта,
	|	ВремВТ.МинимальнаяЦена КАК МинимальнаяЦена
	|ИЗ
	|	ВремВТ КАК ВремВТ";

	// 2. Параметры запроса
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("СпецЦены", Объект.СпецЦены);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);

	// Субконто читаются из справочника СеткиСпецЦен — одно поле вместо трёх.
	ПарСубконто1 = Неопределено;
	ПарСубконто2 = Неопределено;
	ПарСубконто3 = Неопределено;

	Если Объект.СпецЦены И ЗначениеЗаполнено(Объект.СпецСетка) Тогда
		РеквизитыСетки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Объект.СпецСетка,
			"СубконтоСпецЦены, СубконтоСпецЦены2, СубконтоСпецЦены3");
		ПарСубконто1 = РеквизитыСетки.СубконтоСпецЦены;
		ПарСубконто2 = РеквизитыСетки.СубконтоСпецЦены2;
		ПарСубконто3 = РеквизитыСетки.СубконтоСпецЦены3;
	КонецЕсли;

	Запрос.УстановитьПараметр("СубконтоСпецЦены", ПарСубконто1);
	Запрос.УстановитьПараметр("СубконтоСпецЦены2", ПарСубконто2);
	Запрос.УстановитьПараметр("СубконтоСпецЦены3", ПарСубконто3);
	// Доработка END

	// 3. Конвертация суммы обеспечения в рубли
	Если Объект.ВалютаОбеспечения <> Справочники.Валюты.НайтиПоНаименованию("RUB") Тогда
		СтруктураКурса = Новый Структура("Валюта", Объект.ВалютаОбеспечения);
		КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, СтруктураКурса).Курс;
		Если КурсВалюты = Неопределено Тогда
			КурсВалюты = 1;
		КонецЕсли;
		пСуммаОбеспечения = СуммаОбеспечения * КурсВалюты;
	Иначе
		пСуммаОбеспечения = СуммаОбеспечения;
	КонецЕсли;

	// 4. Выполнение пакета запросов
	МасРезультат = Запрос.ВыполнитьПакет();

	// Доработка START {CRITICAL #9: При первом вызове с кешем — заполнить кеш и вернуть через НайтиЦенуВКешеСетки} {2026-04-09}
	Если КешСетки <> Неопределено Тогда
		ВыборкаКлючКеш = МасРезультат[2].Выбрать();
		Если НЕ ВыборкаКлючКеш.Следующий() Тогда
			КешСетки.Вставить("Загружено", Истина);
			КешСетки.Вставить("Пусто", Истина);
			// Доработка START {Упрощение СпецЦены: диагностика по выбранной спец-сетке} {2026-04-11}
			Если Объект.СпецЦены Тогда
				ОбщегоНазначения.СообщитьПользователю(
					"Обеспечение: спец-сетка не найдена для контрагента """ + Объект.Контрагент + """."
					+ " Выберите спец-сетку в поле рядом с флагом ""Спец цены"","
					+ " либо снимите флаг ""Спец цены"".");
			Иначе
				ОбщегоНазначения.СообщитьПользователю(
					"Обеспечение: тарифная сетка не найдена для контрагента """ + Объект.Контрагент + """.");
			КонецЕсли;
			// Доработка END
			Возврат 0;
		КонецЕсли;

		КешСетки.Вставить("Загружено", Истина);
		КешСетки.Вставить("Пусто", Ложь);
		КешСетки.Вставить("ИспользоватьДопАналитику", ВыборкаКлючКеш.ИспользоватьДополнительнуюАналитику);
		КешСетки.Вставить("ТипДопАналитики", ВыборкаКлючКеш.ТипДополнительнойАналитики);

		МаксСумма = 0;
		СписокСумм = Новый Массив;
		ВыборкаГруппировок = МасРезультат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаГруппировок.Следующий() Тогда
			МаксСумма = ВыборкаГруппировок.ЗначениеАналитики;
			ВыборкаДетали = ВыборкаГруппировок.Выбрать();
			Пока ВыборкаДетали.Следующий() Цикл
				СписокСумм.Добавить(Новый Структура("АналитикаСумм, ЗначениеАналитики",
					ВыборкаДетали.АналитикаСумм, ВыборкаДетали.ЗначениеАналитики));
			КонецЦикла;
		КонецЕсли;
		КешСетки.Вставить("МаксСумма", МаксСумма);
		КешСетки.Вставить("СписокСумм", СписокСумм);

		КешСетки.Вставить("ТаблицаДопАналитик", МасРезультат[4].Выгрузить());
		КешСетки.Вставить("ТаблицаЦен", МасРезультат[5].Выгрузить());

		Возврат НайтиЦенуВКешеСетки(КешСетки, СуммаОбеспечения, Расстояние, Объект);
	КонецЕсли;
	// Доработка END

	НеРассчитыватьЦену = Ложь;
	пТекЦена = 0;

	ВыборкаКлюч = МасРезультат[2].Выбрать();
	Если НЕ ВыборкаКлюч.Следующий() Тогда
		// Доработка START {Упрощение СпецЦены: явная диагностика по Варианту 1} {2026-04-11}
		Если Объект.СпецЦены Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Обеспечение: спец-сетка не найдена для контрагента """ + Объект.Контрагент + """."
				+ " Выберите спец-сетку в поле рядом с флагом ""Спец цены"","
				+ " либо снимите флаг ""Спец цены"".");
		Иначе
			ОбщегоНазначения.СообщитьПользователю(
				"Обеспечение: тарифная сетка не найдена для контрагента """ + Объект.Контрагент + """.");
		КонецЕсли;
		// Доработка END
		Возврат 0;
	КонецЕсли;

	// 5. Проверка расстояния: если аналитика по расстоянию и расстояние = 0 → индивидуальный расчёт
	Если ВыборкаКлюч.ИспользоватьДополнительнуюАналитику
		И ВыборкаКлюч.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние
		И Расстояние = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Обеспечение: расстояние между пунктами = 0. "
			+ "Тарифная сетка использует расстояние как аналитику — расчёт невозможен. "
			+ "Заполните расстояние или проверьте регистр ""Расстояния между таможенными пунктами"".");
		Возврат 0;
	КонецЕсли;

	// Доработка START {FR-007: Cap 12 млн — максимальная сумма обеспечения для расчёта} {2026-04-07}
	МаксимальнаяСуммаОбеспечения = 12000000;
	Если пСуммаОбеспечения > МаксимальнаяСуммаОбеспечения Тогда
		пСуммаОбеспечения = МаксимальнаяСуммаОбеспечения;
	КонецЕсли;
	// Доработка END

	// 6. Подбор аналитики суммы (диапазон обеспечения)
	пАналитикаСумм = Неопределено;

	ВыборкаМаксимумСуммОбеспечения = МасРезультат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаМаксимумСуммОбеспечения.Следующий() Тогда
		Если пСуммаОбеспечения > ВыборкаМаксимумСуммОбеспечения.ЗначениеАналитики Тогда
			// Сумма больше максимума в сетке → индивидуальный расчёт
			ОбщегоНазначения.СообщитьПользователю(
				"Обеспечение: сумма " + Формат(пСуммаОбеспечения, "ЧДЦ=2")
				+ " руб. превышает максимум в тарифной сетке ("
				+ Формат(ВыборкаМаксимумСуммОбеспечения.ЗначениеАналитики, "ЧДЦ=2")
				+ " руб.). Требуется индивидуальный расчёт.");
			Возврат 0;
		Иначе
			ВыборкаСуммОбеспечения = ВыборкаМаксимумСуммОбеспечения.Выбрать();
			Пока ВыборкаСуммОбеспечения.Следующий() Цикл
				Если пСуммаОбеспечения > ВыборкаСуммОбеспечения.ЗначениеАналитики Тогда
					Прервать;
				КонецЕсли;
				пАналитикаСумм = ВыборкаСуммОбеспечения.АналитикаСумм;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(пАналитикаСумм) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Обеспечение: не удалось подобрать диапазон суммы обеспечения в тарифной сетке. "
			+ "Сумма: " + Формат(пСуммаОбеспечения, "ЧДЦ=2") + " руб.");
		Возврат 0;
	КонецЕсли;

	// 7. Подбор дополнительной аналитики (расстояние)
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("АналитикаСумм", пАналитикаСумм);

	Если ВыборкаКлюч.ИспользоватьДополнительнуюАналитику Тогда
		ВыборкаДопАналитики = МасРезультат[4].Выбрать();
		пДопАналитика = Неопределено;

		Если ВыборкаКлюч.ТипДополнительнойАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние Тогда
			Пока ВыборкаДопАналитики.Следующий() Цикл
				Если Расстояние > ВыборкаДопАналитики.ЗначениеАналитики Тогда
					Прервать;
				КонецЕсли;
				пДопАналитика = ВыборкаДопАналитики.ДополнительнаяАналитика;
			КонецЦикла;
		КонецЕсли;

		СтруктураПоиска.Вставить("ДополнительнаяАналитика", пДопАналитика);
	КонецЕсли;

	// 8. Поиск цены в сетке
	ВыборкаЦен = МасРезультат[5].Выбрать();
	Если ВыборкаЦен.НайтиСледующий(СтруктураПоиска) Тогда
		Если ВыборкаЦен.ВидРасчета = Перечисления.ВидыРасчетаЦен.Число Тогда
			// Фиксированная сумма × курс валюты
			СтруктураОтбора = Новый Структура("Валюта", ВыборкаЦен.Валюта);
			КурсВалютыЦены = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, СтруктураОтбора).Курс;
			Если КурсВалютыЦены = Неопределено Тогда
				КурсВалютыЦены = 1;
			КонецЕсли;
			пТекЦена = ВыборкаЦен.Цена * КурсВалютыЦены;
		ИначеЕсли ВыборкаЦен.ВидРасчета = Перечисления.ВидыРасчетаЦен.Процент Тогда
			// Процент от суммы обеспечения
			пТекЦена = Окр(пСуммаОбеспечения * ВыборкаЦен.Цена / 100, 2);
		КонецЕсли;

		// Доработка START {FR-006: минимальная цена обеспечения} {2026-04-07}
		Если ЗначениеЗаполнено(ВыборкаЦен.МинимальнаяЦена)
				И ЗначениеЗаполнено(пТекЦена)
				И пТекЦена < ВыборкаЦен.МинимальнаяЦена Тогда
			пТекЦена = ВыборкаЦен.МинимальнаяЦена;
		КонецЕсли;
		// Доработка END
	КонецЕсли;

	Возврат пТекЦена;

КонецФункции

// Доработка START {CRITICAL #9: Поиск цены в кеше тарифной сетки (без SQL)} {2026-04-09}
// Выполняет тот же алгоритм что шаги 3-8 РассчитатьЦенуПоСетке,
// но работает с предзагруженными таблицами вместо итераторов запросов.
//
&НаСервере
Функция НайтиЦенуВКешеСетки(КешСетки, СуммаОбеспечения, Расстояние, Объект)

	Если СуммаОбеспечения = 0 Тогда
		Возврат 0;
	КонецЕсли;

	// 1. Конвертация суммы обеспечения в рубли
	Если Объект.ВалютаОбеспечения <> Справочники.Валюты.НайтиПоНаименованию("RUB") Тогда
		СтруктураКурса = Новый Структура("Валюта", Объект.ВалютаОбеспечения);
		КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, СтруктураКурса).Курс;
		Если КурсВалюты = Неопределено Тогда
			КурсВалюты = 1;
		КонецЕсли;
		пСуммаОбеспечения = СуммаОбеспечения * КурсВалюты;
	Иначе
		пСуммаОбеспечения = СуммаОбеспечения;
	КонецЕсли;

	// 2. Проверка расстояния
	Если КешСетки.ИспользоватьДопАналитику
		И КешСетки.ТипДопАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние
		И Расстояние = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Обеспечение: расстояние между пунктами = 0. "
			+ "Тарифная сетка использует расстояние как аналитику — расчёт невозможен. "
			+ "Заполните расстояние или проверьте регистр ""Расстояния между таможенными пунктами"".");
		Возврат 0;
	КонецЕсли;

	// 3. Cap 12 млн
	МаксимальнаяСуммаОбеспечения = 12000000;
	Если пСуммаОбеспечения > МаксимальнаяСуммаОбеспечения Тогда
		пСуммаОбеспечения = МаксимальнаяСуммаОбеспечения;
	КонецЕсли;

	// 4. Подбор аналитики суммы (обход массива структур вместо итератора с ИТОГИ)
	пАналитикаСумм = Неопределено;

	Если КешСетки.СписокСумм.Количество() > 0 Тогда
		Если пСуммаОбеспечения > КешСетки.МаксСумма Тогда
			ОбщегоНазначения.СообщитьПользователю(
				"Обеспечение: сумма " + Формат(пСуммаОбеспечения, "ЧДЦ=2")
				+ " руб. превышает максимум в тарифной сетке ("
				+ Формат(КешСетки.МаксСумма, "ЧДЦ=2")
				+ " руб.). Требуется индивидуальный расчёт.");
			Возврат 0;
		Иначе
			Для Каждого СтрокаСуммы Из КешСетки.СписокСумм Цикл
				Если пСуммаОбеспечения > СтрокаСуммы.ЗначениеАналитики Тогда
					Прервать;
				КонецЕсли;
				пАналитикаСумм = СтрокаСуммы.АналитикаСумм;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(пАналитикаСумм) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"Обеспечение: не удалось подобрать диапазон суммы обеспечения в тарифной сетке. "
			+ "Сумма: " + Формат(пСуммаОбеспечения, "ЧДЦ=2") + " руб.");
		Возврат 0;
	КонецЕсли;

	// 5. Подбор дополнительной аналитики (расстояние — из выгруженной таблицы)
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("АналитикаСумм", пАналитикаСумм);

	Если КешСетки.ИспользоватьДопАналитику Тогда
		пДопАналитика = Неопределено;

		Если КешСетки.ТипДопАналитики = Перечисления.ТипыДополнительныхАналитикЦенообразования.Расстояние Тогда
			Для Каждого СтрокаДоп Из КешСетки.ТаблицаДопАналитик Цикл
				Если Расстояние > СтрокаДоп.ЗначениеАналитики Тогда
					Прервать;
				КонецЕсли;
				пДопАналитика = СтрокаДоп.ДополнительнаяАналитика;
			КонецЦикла;
		КонецЕсли;

		СтруктураПоиска.Вставить("ДополнительнаяАналитика", пДопАналитика);
	КонецЕсли;

	// 6. Поиск цены в выгруженной таблице (НайтиСтроки вместо НайтиСледующий)
	пТекЦена = 0;
	НайденныеСтроки = КешСетки.ТаблицаЦен.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаЦены = НайденныеСтроки[0];
		Если СтрокаЦены.ВидРасчета = Перечисления.ВидыРасчетаЦен.Число Тогда
			СтруктураОтбора = Новый Структура("Валюта", СтрокаЦены.Валюта);
			КурсВалютыЦены = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, СтруктураОтбора).Курс;
			Если КурсВалютыЦены = Неопределено Тогда
				КурсВалютыЦены = 1;
			КонецЕсли;
			пТекЦена = СтрокаЦены.Цена * КурсВалютыЦены;
		ИначеЕсли СтрокаЦены.ВидРасчета = Перечисления.ВидыРасчетаЦен.Процент Тогда
			пТекЦена = Окр(пСуммаОбеспечения * СтрокаЦены.Цена / 100, 2);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаЦены.МинимальнаяЦена)
				И ЗначениеЗаполнено(пТекЦена)
				И пТекЦена < СтрокаЦены.МинимальнаяЦена Тогда
			пТекЦена = СтрокаЦены.МинимальнаяЦена;
		КонецЕсли;
	КонецЕсли;

	Возврат пТекЦена;

КонецФункции
// Доработка END

// Определить, является ли транспортное средство легковым автомобилем.
// Проверка по наименованию элемента справочника ТипыТранспортныхСредств:
// если содержит подстроку "легков" (регистронезависимо) → легковой.
//
&НаСервере
Функция ЭтоЛегковыеАвто(КодВидаТС)
	Если НЕ ЗначениеЗаполнено(КодВидаТС) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат СтрНайти(НРег(Строка(КодВидаТС)), "легков") > 0;
КонецФункции

// ---------------------------------------------------------------------------
// CMR
// ---------------------------------------------------------------------------

// Рассчитать стоимость CMR-книжек и доплату за дополнительные коды ТНВЭД.
// Добавляет строку в ОплатыУслуг с типом КодыCMR.
//
&НаСервере
Процедура РассчитатьСуммуCMR(Объект)

	СтруктураПоиска = Новый Структура("Контрагент", Объект.Контрагент);
	СведенияCMR = РегистрыСведений.ЦенообразованиеКодовCMR.ПолучитьПоследнее(Объект.Дата, СтруктураПоиска);

	// Доработка START {Задача 14: CMR только для Комплекс/ТолькоТД, НЕ для ТолькоОбеспечение} {2026-04-13}
	// Строим Соответствие: НомерДополнения → допуск CMR (по ТипУчета родительского ДДП).
	// ТолькоОбеспечение → Ложь (не считать CMR для этой книжки).
	ДопускCMR = ПостроитьДопускCMR(Объект);

	ОбщееКоличествоДеклараций = 0;
	Для Каждого СтрокаCMR Из Объект.КодыCMR Цикл
		Допуск = ДопускCMR.Получить(СтрокаCMR.НомерДополнения);
		Если Допуск = Ложь Тогда
			Продолжить;
		КонецЕсли;
		ОбщееКоличествоДеклараций = ОбщееКоличествоДеклараций + 1;
	КонецЦикла;
	// Доработка END

	Если ОбщееКоличествоДеклараций = 0 Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СведенияCMR.ЦенаЗаПервуюCMR) ИЛИ СведенияCMR.ЦенаЗаПервуюCMR = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			"CMR: тариф CMR не найден для контрагента """ + Объект.Контрагент + """. "
			+ "Проверьте регистр ""Ценообразование кодов CMR"".");
	КонецЕсли;

	// Стоимость CMR-книжек
	СуммаCMR = 0;
	Если ОбщееКоличествоДеклараций = 1 Тогда
		СуммаCMR = СведенияCMR.ЦенаЗаПервуюCMR;
	ИначеЕсли ОбщееКоличествоДеклараций > 1 Тогда
		СуммаCMR = СведенияCMR.ЦенаЗаПервуюCMR
			+ (ОбщееКоличествоДеклараций - 1) * СведенияCMR.ЦенаЗаДополнительнуюCMR;
	КонецЕсли;

	// Доплата за превышение бесплатных кодов ТНВЭД (с фильтрацией по ТипУчета)
	КоличествоДопКодов = РассчитатьКоличествоДопCMR(Объект, СведенияCMR.КоличествоБесплатныхКодов, ДопускCMR);
	СуммаДопКодов = КоличествоДопКодов * СведенияCMR.ЦенаЗаДополнительныйКод;

	СтрокаУслуги = Объект.ОплатыУслуг.Добавить();
	СтрокаУслуги.Услуга = Перечисления.ТипыУслугОрганизации.КодыCMR;
	СтрокаУслуги.Сумма = СуммаCMR;
	СтрокаУслуги.КоличествоКодов = КоличествоДопКодов;
	СтрокаУслуги.СуммаКодов = СуммаДопКодов;
КонецПроцедуры

// Подсчитать общее превышение бесплатных кодов ТНВЭД по всем CMR-строкам.
//
&НаСервере
Функция РассчитатьКоличествоДопCMR(Объект, БесплатныеКоды, ДопускCMR = Неопределено)
	ОбщееПревышениеКодов = 0;
	Для Каждого Строка Из Объект.КодыCMR Цикл
		// Доработка START {Задача 14: фильтрация CMR по ТипУчета родительского ДДП} {2026-04-13}
		Если ДопускCMR <> Неопределено Тогда
			Допуск = ДопускCMR.Получить(Строка.НомерДополнения);
			Если Допуск = Ложь Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		// Доработка END
		Если Строка.КоличествоКодов > БесплатныеКоды Тогда
			ОбщееПревышениеКодов = ОбщееПревышениеКодов + (Строка.КоличествоКодов - БесплатныеКоды);
		КонецЕсли;
	КонецЦикла;
	Возврат ОбщееПревышениеКодов;
КонецФункции

// ---------------------------------------------------------------------------
// Оформление ТД
// ---------------------------------------------------------------------------

// Рассчитать стоимость оформления таможенной декларации (ТД).
// Тариф: базовая ставка + доплата за превышение включённых кодов ТНВЭД.
// Добавляет строку в ДополнительныеУслуги с типом ОформлениеТД.
//
// Аудит 2026-04-04: Переписано — источник тарифов: ЦенообразованиеКодовCMR
// (с фильтром УслугаОрганизации = ОформлениеТД), а не отдельный регистр ТарифыОформленияТД.
//
&НаСервере
Процедура РассчитатьОформлениеТД(Объект)

	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент", Объект.Контрагент);
	СтруктураОтбора.Вставить("УслугаОрганизации", Перечисления.ТипыУслугОрганизации.ОформлениеТД);
	Тариф = РегистрыСведений.ЦенообразованиеКодовCMR.ПолучитьПоследнее(Объект.Дата, СтруктураОтбора);

	// ЦенаУслуги = базовая ставка за оформление одного ТД
	Если НЕ ЗначениеЗаполнено(Тариф.ЦенаУслуги) ИЛИ Тариф.ЦенаУслуги = 0 Тогда
		Возврат;
	КонецЕсли;

	// Доработка START {Задача 14: коды ТНВЭД только для Комплекс/ТолькоТД} {2026-04-13}
	// Исключаем книжки от строк ТолькоОбеспечение.
	ДопускCMR = ПостроитьДопускCMR(Объект);
	ОбщееКоличествоКодов = 0;
	Для Каждого СтрокаCMR Из Объект.КодыCMR Цикл
		Допуск = ДопускCMR.Получить(СтрокаCMR.НомерДополнения);
		Если Допуск = Ложь Тогда
			Продолжить;
		КонецЕсли;
		ОбщееКоличествоКодов = ОбщееКоличествоКодов + СтрокаCMR.КоличествоКодов;
	КонецЦикла;
	// Доработка END

	// Базовая ставка + доплата за превышение бесплатных кодов
	СуммаТД = Тариф.ЦенаУслуги;
	Превышение = ОбщееКоличествоКодов - Тариф.КоличествоБесплатныхКодов;
	Если Превышение > 0 Тогда
		СуммаТД = СуммаТД + Превышение * Тариф.ЦенаЗаДополнительныйКод;
	КонецЕсли;

	// Конвертация валюты если тариф не в рублях
	Если ЗначениеЗаполнено(Тариф.Валюта) Тогда
		ВалютаРуб = исОбщийМодульСервер.ВалютаРегламентированногоУчета();
		Если Тариф.Валюта <> ВалютаРуб Тогда
			СтруктураКурса = Новый Структура("Валюта", Тариф.Валюта);
			КурсВалюты = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата, СтруктураКурса).Курс;
			Если КурсВалюты <> Неопределено И КурсВалюты <> 0 Тогда
				СуммаТД = СуммаТД * КурсВалюты;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	СтрокаТД = Объект.ДополнительныеУслуги.Добавить();
	СтрокаТД.ДополнительнаяУслуга = Перечисления.ТипыУслугОрганизации.ОформлениеТД;
	СтрокаТД.Сумма = Окр(СуммаТД, 2);
КонецПроцедуры

// ---------------------------------------------------------------------------
// Вспомогательные
// ---------------------------------------------------------------------------

// Построить Соответствие: НомерДополнения → допуск CMR (Булево).
// ТолькоОбеспечение → Ложь (CMR/коды не считаются для этой книжки).
// Комплекс/пусто/ТолькоТД → Истина (или Неопределено если не найдено в ДД → считать).
//
&НаСервере
Функция ПостроитьДопускCMR(Объект)
	ДопускCMR = Новый Соответствие;
	Для Каждого СтрокаДД Из Объект.ДанныеДокументов Цикл
		ДопускCMR.Вставить(СтрокаДД.НомерГТД,
			СтрокаДД.ТипУчета <> Перечисления.ТипыУчетаКлиентов.ТолькоОбеспечение);
	КонецЦикла;
	Возврат ДопускCMR;
КонецФункции

// Получить тип учёта контрагента из реквизита ТипУчета.
// Если не заполнен → Комплекс (считаются все услуги).
//
&НаСервере
Функция ПолучитьТипУчетаКонтрагента(Контрагент)
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Перечисления.ТипыУчетаКлиентов.Комплекс;
	КонецЕсли;
	ТипУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ТипУчета");
	Если НЕ ЗначениеЗаполнено(ТипУчета) Тогда
		Возврат Перечисления.ТипыУчетаКлиентов.Комплекс;
	КонецЕсли;
	Возврат ТипУчета;
КонецФункции

// Рассчитать агентское вознаграждение (по умолчанию 25% от суммы к оплате).
//
Процедура РассчитатьАгентскиеВознаграждения(Объект)
	Если Объект.АгентскоеВознаграждениеПроцент = 0 Тогда
		Объект.АгентскоеВознаграждениеПроцент = 25;
	КонецЕсли;

	Если Объект.Оплата > 0 Тогда
		Объект.АгентскоеВознаграждениеСумма = Объект.Оплата * Объект.АгентскоеВознаграждениеПроцент / 100;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
